@echo off
rem --------------------------------------------------------------------------------
set game=F:\AltV\altv.exe
set ip=boston.majestic-files.com
set server=boston.majestic-files.com:443
rem --------------------------------------------------------------------------------
rem game="Путь к файлу AltV"
rem ip="Укзать ваш IP сервера" без :443 
rem Пример: ip=dallas.majestic-files.com
rem А в server= "Укзать ваш IP сервера" с :443 
rem Пример: server=dallas.majestic-files.com:443
rem IP сервера можно найти в папке AltV в файлике history.servers
rem Но у вас будет выглядить вот так вот dallas.majestic-files.com:443
rem Вам нужно dallas.majestic-files.com
rem Если у вас стоит Majestic Launcher, то нужно зажать Windows + R
rem В открытом окне ввести %appdata% в папке local есть папка altv-majestic
rem --------------------------------------------------------------------------------
chcp 65001
color 04
taskkill /f /t /im GTA5*
taskkill /f /t /im altv*
taskkill /f /t /im Rockstar*
ping -n 1 -l 300 majestic-rp.ru
ping -n 2 -l 300 %ip%
cls
rem --------------------------------------------------------------------------------
echo ──────────────────────────────────────────
echo ──────────────▒███░───░████████▒ 
echo ───────────█████▒░█████░▒▒▒▒▒▒█████ 
echo ──────────██▒▒▒▒██████████████▒▒▒██░ 
echo ─────────██▒▒▒▒███▒██▒██▒▒█████▒░▒██ 
echo ─────────█░▒▒▒██▒████████████▒█▒▒▒█░ 
echo ─────────█▒▒▒▒██▒▒▒░▓▓▒░▓▒▒████▒▒██ 
echo ─────────█▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒█▒█░▒████ 
echo ─────███████████▒▒▒▒▒▒▒▒██████▒██▓▒███ 
echo ─────██▒▒▒▒▒▒█████▒▒▒▒▒▒▒▒█████▒▒▒▒▒██ 		Ваш пользователь: %USERNAME%
echo ───────██▒▒▒▒▒▒▒▓██████▒▒▒▒▒██▒▒▒▒▒▒███ 
echo ────█████▒▒▒▒▒▒▒▒▒▒████▒▒▒██▒▒▒▒▒▒███ 		Время: %TIME% Дата: %DATE%
echo ────██▒▒▒███▒▒▒▒▒▒▒▒▒▒▓█████▒▒▒▒▒███ 
echo ────███▒▒▒▒███▒▒▒▒▒▒▒▒▒▒▒███▓▒▒███ 
echo ──────█████▒▒████▒▒▒▒▒▒▒▒▒▒█████ 
echo ─────────████▒▒██████▒▒▒▒█████ 
echo ────────────███▒▒██████████ 
echo ──────────────████▓──█▓█ 
echo ────────────────────████ 
echo ────────────────────█░█─────█████████ 		Создал beast_968
echo ────────────────────█▓█───█████████████ 
echo ──░█████████───────████──██▓███▒▓████ 		Спасибо за внимание!
echo ─█████████████─────█░███████░██████ 
echo ───████░▒███▒██────█▓██████████ 
echo ─────█████▓▒█████─████ 
echo ─────────██████████▓█ 
echo ──────────────────────────────────────────
rem --------------------------------------------------------------------------------
start /WAIT /REALTIME %game% -connecturl %server%
exit